replay.har

{"log":{"version":"1.2","creator":{"name":"LoadRunner","version":"2021.0.0.0"},"pages":[{"startedDateTime":"2021-03-18T13:04:25.689-06:00","id":"page_1","title":"https://americas.stp2perf2.tvlport.com/B2BGateway/service/XMLSelect","pageTimings":{}}],"entries":[{"pageref":"page_1","startedDateTime":"2021-03-18T13:04:25.689-06:00","time":2670,"request":{"method":"POST","url":"https://americas.stp2perf2.tvlport.com/B2BGateway/service/XMLSelect","httpVersion":"HTTP/1.1","cookies":[],"headers":[{"name":"Authorization","value":"Basic VERTV1MvTE9BRFJVTk5FUjA0OmNveW90RTAz"},{"name":"Content-Type","value":"text/xml; charset=utf-8"},{"name":"Cache-Control","value":"no-cache"},{"name":"SOAPAction","value":"\"http://webservices.galileo.com/SubmitXml\""},{"name":"User-Agent","value":"Mozilla/5.0 (compatible; MSIE 10.0; Windows NT 6.1; Trident/6.0)"},{"name":"Accept-Encoding","value":"gzip, deflate"},{"name":"Accept","value":"*/*"},{"name":"Connection","value":"Keep-Alive"},{"name":"Host","value":"americas.stp2perf2.tvlport.com"},{"name":"Content-Length","value":"3134"}],"queryString":[],"headersSize":433,"bodySize":3134,"postData":{"mimeType":"text/xml; charset=utf-8","text":"<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><SubmitXml xmlns=\"http://webservices.galileo.com\"><Profile>APOLLOCOPYJ0BF328D1</Profile><Request><AirAvailabilityByTariff_13><FareDisplayMods><QueryHeader><UniqueKey>0000</UniqueKey><LangNum>0</LangNum><Action>2</Action><RetCRTOutput /><NoMsg /><NoTrunc>Y</NoTrunc><IMInd /><FIPlus /><PEInd /><PVInd /><NBInd /><ActionOnlyInd /><TranslatePeriod /><PIInd /><IntFrame1>Y</IntFrame1><SmartParsed>Y</SmartParsed><PDCodes /><BkDtOverride /><HostUse25 /><DefCurrency /><PFPWInd>Y</PFPWInd><PFPQInd /><HostUse29 /><HostUse30 /><HostUse31 /><HostUse32 /><HostUse33 /><TariffQual><DispYYasBlanks /><NoAirpSort>Y</NoAirpSort><HiLo>N</HiLo><PRIInd>Y</PRIInd><FormulaDisp /><NonIntegratedDisp>N</NonIntegratedDisp><PrivDisp /><HMCTInd /><RemvInfants /><HistFaresInd /><NoCompFares>Y</NoCompFares><ExcTaxes /><HostUseOnly /><StructTariffDispResp /><PrefDataRequired /><NetFaresOnly>N</NetFaresOnly></TariffQual></QueryHeader><TravConstraints><UniqueKey>0000</UniqueKey><StartPt>NYC</StartPt><EndPt>LHR</EndPt><OW>N</OW><RT>Y</RT><LongDispInd>N</LongDispInd><ValidatingDispInd>N</ValidatingDispInd><NUCInd>N</NUCInd><RetDataInd /><HostUse21>Y</HostUse21><BaseFares>N</BaseFares><ConxPts /><IncDomTax>Y</IncDomTax><ConvAP /><FQSFareType>N</FQSFareType><HalfRT>N</HalfRT><CalShopReq /><CheckAltCitiesExist /><RetAltCityQuote /><StartDt>20201119</StartDt><AirV1>BA</AirV1><AirV2 /><AirV3 /><GlobDir /><ConxPt1 /><ConxPt2 /><EndDt /><TkDt /><FareType /><Currency /><Pt /><SellCurrency /><JointFares>N</JointFares><RndWorld>N</RndWorld><CircTrip>N</CircTrip><DoubleOneWay /><AltDatesReq /><Surcharges /><Spare1 /><SkipEffDtProcess>N</SkipEffDtProcess><CabinNum>0</CabinNum><EffStartDtFilter /><EffEndDtFilter /><AgencyPvtFare>N</AgencyPvtFare><AirlinePvtFare>N</AirlinePvtFare><Spare2>NNNNNN</Spare2></TravConstraints><PFMods><UniqueKey>0</UniqueKey><PCC>J0B</PCC><Acct>VLTEST</Acct><Contract /><RedistApplies>N</RedistApplies><ApplyAgencyPvtFare>N</ApplyAgencyPvtFare><ApplyAirlinePvtFare>N</ApplyAirlinePvtFare><AgencyPvtFareInd>Y</AgencyPvtFareInd><AirlinePvtFareInd>N</AirlinePvtFareInd><LLPFApplies>N</LLPFApplies><AcctCodeInd>Y</AcctCodeInd><Spare>N</Spare></PFMods></FareDisplayMods><AirAvailMods><GenAvail><NumSeats>1</NumSeats><Class></Class><StartDt>20201119</StartDt><StartPt>JFK</StartPt><EndPt>LHR</EndPt><StartTm>0001</StartTm><TmWndInd>D</TmWndInd><StartTmWnd>000</StartTmWnd><EndTmWnd>2359</EndTmWnd><JrnyTm><![CDATA[ ]]></JrnyTm><IgnoreTSPref>Y</IgnoreTSPref><MaxNumFlts></MaxNumFlts></GenAvail><GenAvail><NumSeats>1</NumSeats><Class></Class><StartDt>20201130</StartDt><StartPt>LHR</StartPt><EndPt>JFK</EndPt><StartTm>0001</StartTm><TmWndInd>D</TmWndInd><StartTmWnd>000</StartTmWnd><EndTmWnd>2359</EndTmWnd><JrnyTm><![CDATA[ ]]></JrnyTm><IgnoreTSPref>Y</IgnoreTSPref><MaxNumFlts></MaxNumFlts></GenAvail></AirAvailMods></AirAvailabilityByTariff_13></Request><Filter><_/></Filter></SubmitXml></soap:Body></soap:Envelope>"},"_http2_info":null},"response":{"status":200,"statusText":"OK","httpVersion":"HTTP/1.1","cookies":[],"headers":[{"name":"Content-Type","value":"text/xml;charset=utf-8"},{"name":"Transfer-Encoding","value":"chunked"},{"name":"Connection","value":"keep-alive"},{"name":"Server","value":"Apache-Coyote/1.1"},{"name":"Content-Encoding","value":"gzip"},{"name":"Date","value":"Thu, 18 Mar 2021 19:04:29 GMT"}],"content":{"size":5283,"compression":0,"mimeType":"text/xml;charset=utf-8","text":"<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\">\n <soapenv:Body><SubmitXmlResponse xmlns=\"http://webservices.galileo.com\"><SubmitXmlResult><AirAvailabilityByTariff_13 xmlns=\"\"><AirAvail><MoreToken><Tok>302080198190567-85803716073674</Tok></MoreToken><AvailSummary><NumSegs>2</NumSegs><StartPt>JFK</StartPt><StartCity>NYC</StartCity><EndPt>LHR</EndPt><EndCity>LON</EndCity><ErrInd>0</ErrInd><ErrNum>0</ErrNum></AvailSummary><AvailFlt><AirV>AA</AirV><FltNum>6939</FltNum><OpSuf/><StartDt>20201119</StartDt><StartAirp>JFK</StartAirp><EndAirp>LHR</EndAirp><StartTm>805</StartTm><EndTm>1950</EndTm><DayChg>00</DayChg><Conx>N</Conx><AirpChg>N</AirpChg><Equip>744</Equip><Spare1/><NumStops>0</NumStops><OpAirVInd>Y</OpAirVInd><Perf/><LinkSellAgrmnt>SS</LinkSellAgrmnt><DispOption>Y</DispOption><InsideAvailOption>Y</InsideAvailOption><GenTrafRestriction/><DaysOperates>YYYYYYY</DaysOperates><JrnyTm>405</JrnyTm><EndDt>20201119</EndDt><OpAirV>BA</OpAirV><OpFltDesignator>0178</OpFltDesignator><OpFltSuf/><StartTerminal>7</StartTerminal><EndTerminal>5</EndTerminal><FltTm>405</FltTm><LSAInd>N</LSAInd><GalileoAirVInd>Y</GalileoAirVInd><ETktEligibility>E</ETktEligibility><ScheduleLevelCarrier/><FrstDwnlnStp/><LastDwnlnStp/><SponsoredFltInd>N</SponsoredFltInd><SponsoredFltLineNum>00</SponsoredFltLineNum><NeutralFltLineNum>01</NeutralFltLineNum><SponsoredFltKey>00000</SponsoredFltKey><AvailSource>A</AvailSource></AvailFlt><FltAvailStatus><Status/><First>A</First><Business>A</Business><Coach>A</Coach><MoreClasses/></FltAvailStatus><BICAvail><BICStatusAry><BICStatus><BIC>R</BIC><Status>007</Status></BICStatus><BICStatus><BIC>P</BIC><Status>007</Status></BICStatus><BICStatus><BIC>F</BIC><Status>007</Status></BICStatus><BICStatus><BIC>A</BIC><Status>007</Status></BICStatus><BICStatus><BIC>J</BIC><Status>007</Status></BICStatus><BICStatus><BIC>D</BIC><Status>007</Status></BICStatus><BICStatus><BIC>S</BIC><Status>007</Status></BICStatus><BICStatus><BIC>Y</BIC><Status>007</Status></BICStatus><BICStatus><BIC>W</BIC><Status>007</Status></BICStatus><BICStatus><BIC>B</BIC><Status>007</Status></BICStatus><BICStatus><BIC>H</BIC><Status>007</Status></BICStatus><BICStatus><BIC>M</BIC><Status>007</Status></BICStatus><BICStatus><BIC>N</BIC><Status>007</Status></BICStatus><BICStatus><BIC>K</BIC><Status>007</Status></BICStatus><BICStatus><BIC>L</BIC><Status>007</Status></BICStatus><BICStatus><BIC>Q</BIC><Status>007</Status></BICStatus><BICStatus><BIC>V</BIC><Status>007</Status></BICStatus><BICStatus><BIC>G</BIC><Status>007</Status></BICStatus><BICStatus><BIC>I</BIC><Status>007</Status></BICStatus><BICStatus><BIC>O</BIC><Status>007</Status></BICStatus></BICStatusAry></BICAvail><AvailFlt><AirV>DL</AirV><FltNum>4371</FltNum><OpSuf/><StartDt>20201119</StartDt><StartAirp>JFK</StartAirp><EndAirp>LHR</EndAirp><StartTm>805</StartTm><EndTm>2000</EndTm><DayChg>00</DayChg><Conx>N</Conx><AirpChg>N</AirpChg><Equip>351</Equip><Spare1/><NumStops>0</NumStops><OpAirVInd>Y</OpAirVInd><Perf/><LinkSellAgrmnt>SS</LinkSellAgrmnt><DispOption>Y</DispOption><InsideAvailOption>Y</InsideAvailOption><GenTrafRestriction>F</GenTrafRestriction><DaysOperates>YYYYYYY</DaysOperates><JrnyTm>415</JrnyTm><EndDt>20201119</EndDt><OpAirV>VS</OpAirV><OpFltDesignator>0026</OpFltDesignator><OpFltSuf/><StartTerminal>4</StartTerminal><EndTerminal>3</EndTerminal><FltTm>415</FltTm><LSAInd>N</LSAInd><GalileoAirVInd>Y</GalileoAirVInd><ETktEligibility>E</ETktEligibility><ScheduleLevelCarrier/><FrstDwnlnStp/><LastDwnlnStp/><SponsoredFltInd>N</SponsoredFltInd><SponsoredFltLineNum>00</SponsoredFltLineNum><NeutralFltLineNum>02</NeutralFltLineNum><SponsoredFltKey>00000</SponsoredFltKey><AvailSource>A</AvailSource></AvailFlt><FltAvailStatus><Status/><First>N</First><Business>A</Business><Coach>A</Coach><MoreClasses/></FltAvailStatus><BICAvail><BICStatusAry><BICStatus><BIC>J</BIC><Status>009</Status></BICStatus><BICStatus><BIC>C</BIC><Status>009</Status></BICStatus><BICStatus><BIC>D</BIC><Status>009</Status></BICStatus><BICStatus><BIC>I</BIC><Status>009</Status></BICStatus><BICStatus><BIC>Z</BIC><Status>009</Status></BICStatus><BICStatus><BIC>P</BIC><Status>009</Status></BICStatus><BICStatus><BIC>A</BIC><Status>009</Status></BICStatus><BICStatus><BIC>W</BIC><Status>009</Status></BICStatus><BICStatus><BIC>S</BIC><Status>009</Status></BICStatus><BICStatus><BIC>Y</BIC><Status>009</Status></BICStatus><BICStatus><BIC>B</BIC><Status>009</Status></BICStatus><BICStatus><BIC>M</BIC><Status>009</Status></BICStatus><BICStatus><BIC>H</BIC><Status>009</Status></BICStatus><BICStatus><BIC>Q</BIC><Status>009</Status></BICStatus><BICStatus><BIC>K</BIC><Status>009</Status></BICStatus><BICStatus><BIC>L</BIC><Status>009</Status></BICStatus><BICStatus><BIC>U</BIC><Status>009</Status></BICStatus><BICStatus><BIC>T</BIC><Status>009</Status></BICStatus><BICStatus><BIC>X</BIC><Status>009</Status></BICStatus><BICStatus><BIC>V</BIC><Status>009</Status></BICStatus><BICStatus><BIC>E</BIC><Status>009</Status></BICStatus></BICStatusAry></BICAvail></AirAvail></AirAvailabilityByTariff_13></SubmitXmlResult></SubmitXmlResponse></soapenv:Body></soapenv:Envelope>","encoding":"Raw"},"redirectURL":"","headersSize":197,"bodySize":1312,"_http2_info":null},"cache":{},"timings":{"blocked":-1,"dns":3,"connect":217,"send":56,"wait":1335,"receive":1059,"ssl":154},"serverIpAddress":"10.7.254.141","connection":"172.31.173.15:1358"}],"_actions":[{"_iterationNum":0,"_actionName":"vuser_init","_steps":[],"_transactions":[]},{"_iterationNum":1,"_actionName":"Action1","_steps":[{"_stepId":"STEP1","_stepName":"XMLSelect_Sessionless_5192_AirAvailabilityByTariff_13_1V","_stepStartTime":"2021-03-18T13:04:25.657-06:00","_rawStartTime":1616094265657,"_url":"https://americas.stp2perf2.tvlport.com/B2BGateway/service/XMLSelect","_stepEndTime":"1969-12-31T17:00:00.000-07:00","_rawEndTime":0}],"_transactions":[{"_transactionName":"XWS_sessionless_5192_AirAvailabilityByTariff_13_1V_CGR","_transactionStartTime":"2021-03-18T13:04:25.653-06:00","_rawStartTime":1616094265653,"_transactionEndTime":"2021-03-18T13:04:28.473-06:00","_rawEndTime":1616094268473,"_thinkTime":0,"_wastedTime":128}]},{"_iterationNum":2,"_actionName":"vuser_end","_steps":[],"_transactions":[]}]}}